liYony/FastMCU/bsp/stm32/libraries/HAL_Drivers/drv_usart.c
#if defined(BSP_USING_UART1)
void USART1_IRQHandler(void)
{
    uart_isr(&(uart_obj[UART1_INDEX].serial));
}
#if defined(FM_SERIAL_USING_DMA) && defined(BSP_UART1_RX_USING_DMA)
void UART1_DMA_RX_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&uart_obj[UART1_INDEX].dma_rx.handle);
}
#endif /* defined(FM_SERIAL_USING_DMA) && defined(BSP_UART1_RX_USING_DMA) */
#if defined(FM_SERIAL_USING_DMA) && defined(BSP_UART1_TX_USING_DMA)
void UART1_DMA_TX_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&uart_obj[UART1_INDEX].dma_tx.handle);
}
#endif /* defined(FM_SERIAL_USING_DMA) && defined(BSP_UART1_TX_USING_DMA) */
#endif /* BSP_USING_UART1 */

#if defined(BSP_USING_UART2)
void USART2_IRQHandler(void)
{
    uart_isr(&(uart_obj[UART2_INDEX].serial));
}
#if defined(FM_SERIAL_USING_DMA) && defined(BSP_UART2_RX_USING_DMA)
void UART2_DMA_RX_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&uart_obj[UART2_INDEX].dma_rx.handle);
}
#endif /* defined(FM_SERIAL_USING_DMA) && defined(BSP_UART2_RX_USING_DMA) */
#if defined(FM_SERIAL_USING_DMA) && defined(BSP_UART2_TX_USING_DMA)
void UART2_DMA_TX_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&uart_obj[UART2_INDEX].dma_tx.handle);
}
#endif /* defined(FM_SERIAL_USING_DMA) && defined(BSP_UART2_TX_USING_DMA) */
#endif /* BSP_USING_UART2 */

#if defined(BSP_USING_UART3)
void USART3_IRQHandler(void)
{
    uart_isr(&(uart_obj[UART3_INDEX].serial));
}
#if defined(FM_SERIAL_USING_DMA) && defined(BSP_UART3_RX_USING_DMA)
void UART3_DMA_RX_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&uart_obj[UART3_INDEX].dma_rx.handle);
}
#endif /* defined(BSP_UART_USING_DMA_RX) && defined(BSP_UART3_RX_USING_DMA) */
#if defined(FM_SERIAL_USING_DMA) && defined(BSP_UART3_TX_USING_DMA)
void UART3_DMA_TX_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&uart_obj[UART3_INDEX].dma_tx.handle);
}
#endif /* defined(BSP_UART_USING_DMA_TX) && defined(BSP_UART3_TX_USING_DMA) */
#endif /* BSP_USING_UART3*/

#if defined(BSP_USING_UART4)
void UART4_IRQHandler(void)
{
    uart_isr(&(uart_obj[UART4_INDEX].serial));
}
#if defined(FM_SERIAL_USING_DMA) && defined(BSP_UART4_RX_USING_DMA)
void UART4_DMA_RX_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&uart_obj[UART4_INDEX].dma_rx.handle);
}
#endif /* defined(BSP_UART_USING_DMA_RX) && defined(BSP_UART4_RX_USING_DMA) */

#if defined(FM_SERIAL_USING_DMA) && defined(BSP_UART4_TX_USING_DMA)
void UART4_DMA_TX_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&uart_obj[UART4_INDEX].dma_tx.handle);
}
#endif /* defined(BSP_UART_USING_DMA_TX) && defined(BSP_UART4_TX_USING_DMA) */
#endif /* BSP_USING_UART4*/

#if defined(BSP_USING_UART5)
void UART5_IRQHandler(void)
{
    uart_isr(&(uart_obj[UART5_INDEX].serial));
}
#if defined(FM_SERIAL_USING_DMA) && defined(BSP_UART5_RX_USING_DMA)
void UART5_DMA_RX_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&uart_obj[UART5_INDEX].dma_rx.handle);
}
#endif /* defined(FM_SERIAL_USING_DMA) && defined(BSP_UART5_RX_USING_DMA) */
#if defined(FM_SERIAL_USING_DMA) && defined(BSP_UART5_TX_USING_DMA)
void UART5_DMA_TX_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&uart_obj[UART5_INDEX].dma_tx.handle);
}
#endif /* defined(FM_SERIAL_USING_DMA) && defined(BSP_UART5_TX_USING_DMA) */
#endif /* BSP_USING_UART5*/

#if defined(BSP_USING_UART6)
void USART6_IRQHandler(void)
{
    uart_isr(&(uart_obj[UART6_INDEX].serial));
}
#if defined(FM_SERIAL_USING_DMA) && defined(BSP_UART6_RX_USING_DMA)
void UART6_DMA_RX_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&uart_obj[UART6_INDEX].dma_rx.handle);
}
#endif /* defined(FM_SERIAL_USING_DMA) && defined(BSP_UART6_RX_USING_DMA) */
#if defined(FM_SERIAL_USING_DMA) && defined(BSP_UART6_TX_USING_DMA)
void UART6_DMA_TX_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&uart_obj[UART6_INDEX].dma_tx.handle);
}
#endif /* defined(FM_SERIAL_USING_DMA) && defined(BSP_UART6_TX_USING_DMA) */
#endif /* BSP_USING_UART6*/

#if defined(BSP_USING_UART7)
void UART7_IRQHandler(void)
{
    uart_isr(&(uart_obj[UART7_INDEX].serial));
}
#if defined(FM_SERIAL_USING_DMA) && defined(BSP_UART7_RX_USING_DMA)
void UART7_DMA_RX_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&uart_obj[UART7_INDEX].dma_rx.handle);
}
#endif /* defined(FM_SERIAL_USING_DMA) && defined(BSP_UART7_RX_USING_DMA) */
#if defined(FM_SERIAL_USING_DMA) && defined(BSP_UART7_TX_USING_DMA)
void UART7_DMA_TX_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&uart_obj[UART7_INDEX].dma_tx.handle);
}
#endif /* defined(FM_SERIAL_USING_DMA) && defined(BSP_UART7_TX_USING_DMA) */
#endif /* BSP_USING_UART7*/

#if defined(BSP_USING_UART8)
void UART8_IRQHandler(void)
{
    uart_isr(&(uart_obj[UART8_INDEX].serial));
}
#if defined(FM_SERIAL_USING_DMA) && defined(BSP_UART8_RX_USING_DMA)
void UART8_DMA_RX_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&uart_obj[UART8_INDEX].dma_rx.handle);
}
#endif /* defined(FM_SERIAL_USING_DMA) && defined(BSP_UART8_RX_USING_DMA) */
#if defined(FM_SERIAL_USING_DMA) && defined(BSP_UART8_TX_USING_DMA)
void UART8_DMA_TX_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&uart_obj[UART8_INDEX].dma_tx.handle);
}
#endif /* defined(FM_SERIAL_USING_DMA) && defined(BSP_UART8_TX_USING_DMA) */
#endif /* BSP_USING_UART8*/

#if defined(BSP_USING_LPUART1)
void LPUART1_IRQHandler(void)
{
    uart_isr(&(uart_obj[LPUART1_INDEX].serial));
}
#if defined(FM_SERIAL_USING_DMA) && defined(BSP_LPUART1_RX_USING_DMA)
void LPUART1_DMA_RX_IRQHandler(void)
{
    HAL_DMA_IRQHandler(&uart_obj[LPUART1_INDEX].dma_rx.handle);
}
#endif /* defined(FM_SERIAL_USING_DMA) && defined(BSP_LPUART1_RX_USING_DMA) */
#endif /* BSP_USING_LPUART1*/
static void stm32_uart_get_config(void)
{
    struct serial_configure config = FM_SERIAL_CONFIG_DEFAULT;
#ifdef BSP_USING_UART1
    uart_obj[UART1_INDEX].serial.config = config;
    uart_obj[UART1_INDEX].uart_dma_flag = 0;

    uart_obj[UART1_INDEX].serial.config.rx_bufsz = BSP_UART1_RX_BUFSIZE;
    uart_obj[UART1_INDEX].serial.config.tx_bufsz = BSP_UART1_TX_BUFSIZE;

#ifdef BSP_UART1_RX_USING_DMA
    uart_obj[UART1_INDEX].uart_dma_flag |= FM_DEVICE_FLAG_DMA_RX;
    static struct dma_config uart1_dma_rx = UART1_DMA_RX_CONFIG;
    uart_config[UART1_INDEX].dma_rx = &uart1_dma_rx;
#endif

#ifdef BSP_UART1_TX_USING_DMA
    uart_obj[UART1_INDEX].uart_dma_flag |= FM_DEVICE_FLAG_DMA_TX;
    static struct dma_config uart1_dma_tx = UART1_DMA_TX_CONFIG;
    uart_config[UART1_INDEX].dma_tx = &uart1_dma_tx;
#endif
#endif

